[
    {
        "name": "GIS for the Humanities and the Social Sciences",
        "campus": "Visby",
        "internationInstitution": "Department of Archaeology and Ancient History",
        "academicPeriodName": "Autumn 2023",
        "code": "5AR766",
        "occurenceName": "2023-08-28 to 2023-10-29",
        "period": "Second cycle",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 50,
        "prerequisites": "A Bachelor's degree, equivalent to a Swedish Kandidatexamen, from an internationally recognised university",
        "description": "The course provides you with knowledge and skills in working with Geographic Information Systems (GIS) and how GIS can be used to analyse research questions within the humanities and the social sciences. It introduces theoretical aspects of landscape analysis and GIS. Alongside the lectures, you will work with tutorials after which you will design your own case studies or research projects according to your particular research interest."
    },
    {
        "name": "Historical Ecology",
        "campus": "Visby",
        "internationInstitution": "Department of Archaeology and Ancient History",
        "academicPeriodName": "Autumn 2023",
        "code": "5AR764",
        "occurenceName": "2023-08-28 to 2023-10-29",
        "period": "Second cycle",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 50,
        "prerequisites": "A Bachelor's degree, equivalent to a Swedish Kandidatexamen, from an internationally recognised university",
        "description": "The purpose of this course is to provide students with an overview of the theoretical frameworks offered by historical ecology for understanding interactions between society, environment and climate, as well as their particular complexities. During the course, we will discuss and critically assess the importance of having an integrated and long-term understanding of these complex interactions when we try to comprehend and solve present-day problems of sustainability. You will be given examples of historical ecologies, and we will look at long-term processes of human-environmental interactions and particular case studies."
    },
    {
        "name": "The Prehistory of the Baltic Area",
        "campus": "Visby",
        "internationInstitution": "Department of Archaeology and Ancient History",
        "academicPeriodName": "Autumn 2023",
        "code": "5AR770",
        "occurenceName": "2023-10-30 to 2024-01-14",
        "period": "Second cycle",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 50,
        "prerequisites": "A Bachelor's degree, equivalent to a Swedish Kandidatexamen, from an internationally recognised university",
        "description": "The course compares different local perspectives on the prehistoric development in the Baltic Area to identify cultural similarities and differences based on the archaeological source material and not on historical or contemporary political or national boundaries. Therefore, the whole cultural development of the Baltic Area is in focus."
    },
    {
        "name": "The World in the Viking Age",
        "campus": "Visby",
        "internationInstitution": "Department of Archaeology and Ancient History",
        "academicPeriodName": "Autumn 2023",
        "code": "5AR793",
        "occurenceName": "2023-10-30 to 2024-01-14",
        "period": "Second cycle",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 50,
        "prerequisites": "A Bachelor's degree, equivalent to a Swedish Kandidatexamen, from an internationally recognised university.",
        "description": "The 'Viking diaspora' has traditionally been studied from the Scandinavian perspective, focusing on their experiences of movement and trade, settlement, and violence. However, all these behaviours are linked to a series of disparate and yet deeply-interconnected cultural 'worlds': from those of the Sámi in the north, to the Christian kingdoms of mainland Europe and the British Isles, to the more sparsely populated North Atlantic, to the Slavic populations of the southern and eastern Baltic, the Steppe peoples, the Byzantine Empire and Mediterranean world, and the Caliphate. People from all these regions were also moving into Scandinavia, bringing with them their own cultural influences. Furthermore, Scandinavia acted within even wider connections tied into the arterial trade routes of the Silk Roads, the Red Sea and the Indian Ocean, and in the later part of the Viking Age, with direct access to resources from Greenland and North America. These zones of interaction each exerted their own influences on each other, as well as on the societies of Scandinavia itself. This course is designed to situate the Viking diaspora within its wider, global context, while also exploring interconnectivity across and between regions."
    },
    {
        "name": "Negotiations in a Business Context",
        "campus": "Visby",
        "internationInstitution": "Department of Business Studies",
        "academicPeriodName": "Autumn 2023",
        "code": "2FE975",
        "occurenceName": "2023-11-02 to 2024-01-14",
        "period": "First cycle",
        "creditsDecimal": 15,
        "creditsECTSDecimal": 100,
        "prerequisites": "45 credits in one subject",
        "description": "The course introduces the basic principles of distributive bargaining and integrative negotiation. Moreover, different factors affecting negotiation situations are considered, such as social relationships, power, social norms, and ethical questions. We also address different types of multi-party negotiations and explore how negotiations are affected by the inclusion of more than two parties."
    },
    {
        "name": "Reading Course in Business Studies",
        "campus": "Visby",
        "internationInstitution": "Department of Business Studies",
        "academicPeriodName": "Autumn 2023",
        "code": "2FE974",
        "occurenceName": "2023-08-28 to 2023-11-01",
        "period": "First cycle",
        "creditsDecimal": 15,
        "creditsECTSDecimal": 100,
        "prerequisites": "45 credits in one subject",
        "description": "The purpose of the course is to train you in getting an overview of a research topic or question within the field of business studies. During the course, you will work independently, supported by individual or small group meetings with their supervisor/tutor. Depending on the number of participants, the course may include group activities (such as presentations and discussion of their work with other participants)."
    },
    {
        "name": "Cultural and Natural Heritage",
        "campus": "Visby",
        "internationInstitution": "Department of Cultural Anthropology and Ethnology",
        "academicPeriodName": "Autumn 2023",
        "code": "5EE003",
        "occurenceName": "2023-09-28 to 2023-10-30",
        "period": "Second cycle",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 100,
        "prerequisites": "A Bachelor's degree, equivalent to a Swedish Kandidatexamen, from an internationally recognised university. The main field of study must be within the social sciences or the humanities. This prerequisite may be replaced by Introduction to Sustainable Destination Development. Proficiency in English equivalent to the Swedish upper secondary course English 6.",
        "description": "Are you curious about what happens when something is recognised as a cultural or natural heritage? What are the consequences of this recognition and how does it shape the way we perceive the world? Cultural and natural heritage are powerful concepts that create what they are referring to, and during the course, we will discuss how this is achieved. We examine different heritage processes on a global, national, regional and local level, using the example of Gotland as a point of departure but with international outlooks."
    },
    {
        "name": "Sustainable Heritage Destinations",
        "campus": "Visby",
        "internationInstitution": "Department of Cultural Anthropology and Ethnology",
        "academicPeriodName": "Autumn 2023",
        "code": "5EE005",
        "occurenceName": "2023-10-31 to 2024-01-14",
        "period": "Second cycle",
        "creditsDecimal": 15,
        "creditsECTSDecimal": 100,
        "prerequisites": "A Bachelor's degree, equivalent to a Swedish Kandidatexamen, from an internationally recognised university. The main field of study must be within the social sciences or the humanities. This prerequisite may be replaced by Introduction to Sustainable Destination Development. Proficiency in English equivalent to the Swedish upper secondary course English 6.",
        "description": "Do you want to explore how heritage destinations might become socially and culturally sustainable? In this course, we focus on tourism to heritage destinations and examine how a destination is constructed through the use of narratives, images and imaginaries, enactment and placemaking. We study how this has been done in different parts of the world earlier and reflect on how we might do it in more sustainable ways in the future. The course includes collaboration with local stakeholders, primarily on Gotland."
    },
    {
        "name": "A Sustainable Future - Theory and Transdisciplinary Visions",
        "campus": "Visby",
        "internationInstitution": "Department of Earth Sciences",
        "academicPeriodName": "Autumn 2023",
        "code": "1GV199",
        "occurenceName": "2023-08-28 to 2024-01-14",
        "period": "General entry requirements",
        "creditsDecimal": 15,
        "creditsECTSDecimal": 50,
        "prerequisites": "",
        "description": "In this course, we explore the concept of sustainability and how we can create sustainable cultures in our complex world. Sustainability challenges resist disciplinary categories and simple solutions. This course provides an introduction to real-world, complex sustainability challenges through literature drawn from natural and social sciences and the humanities, from interdisciplinary theory, and from insights into cases of sustainability issues around the world."
    },
    {
        "name": "A Sustainable Future - Transdisciplinary Practices",
        "campus": "Visby",
        "internationInstitution": "Department of Earth Sciences",
        "academicPeriodName": "Autumn 2023",
        "code": "1GV201",
        "occurenceName": "2023-08-28 to 2024-01-14",
        "period": "General entry requirements",
        "creditsDecimal": 15,
        "creditsECTSDecimal": 50,
        "prerequisites": "",
        "description": "This course provides a practical entry point to real-world sustainability challenges through literature drawn from natural and social sciences and the humanities, interdisciplinary theory, and from insights into cases of complex sustainability issues and social movements around the world. The course highlights and problematises the major relevant critical perspectives on sustainability and aims to go beyond simplified notions of sustainability. There is a strong focus on building collaborations with local communities with the aim of creating projects that are solutions-oriented."
    },
    {
        "name": "Construction, Operation and Maintenance of Wind Farms",
        "campus": "Visby",
        "internationInstitution": "Department of Earth Sciences",
        "academicPeriodName": "Autumn 2023",
        "code": "1GV156",
        "occurenceName": "2023-08-28 to 2023-10-30",
        "period": "Second cycle",
        "creditsDecimal": 10,
        "creditsECTSDecimal": 67,
        "prerequisites": "A Bachelor's degree in engineering, science or social science. Also required is 45 credits at Master's level in wind power project management. Proficiency in English equivalent to the Swedish upper secondary course English 6.",
        "description": "The course introduces the logistical theory and best practices for wind power project construction, operation and decommissioning. These are used to create a logistical plan which identifies and provides solutions for potential problems and risks of a project. In addition, the course will identify key concerns and solutions for the construction and operation phases of a wind power project which are used during its planning, including health and safety issues. Included in this the lifetime operations and maintenance costs, both onshore and offshore will be reviewed in both theory and practice."
    },
    {
        "name": "Energy and Systems",
        "campus": "Visby",
        "internationInstitution": "Department of Earth Sciences",
        "academicPeriodName": "Autumn 2023",
        "code": "1GV164",
        "occurenceName": "2023-10-31 to 2024-01-14",
        "period": "General entry requirements",
        "creditsDecimal": 5,
        "creditsECTSDecimal": 33,
        "prerequisites": "",
        "description": "The course provides knowledge about energy usage from a sustainability and system perspective. In the course system theory and basic energy concepts are taken up and applied and the energy system at different scales is reviewed. The course also gives insight into how energy has been produced and used historically, political issues around it as well as the geographic spread of needed resources."
    },
    {
        "name": "Environmental Economics and Ecological Economics",
        "campus": "Visby",
        "internationInstitution": "Department of Earth Sciences",
        "academicPeriodName": "Autumn 2023",
        "code": "1GV108",
        "occurenceName": "2023-11-21 to 2024-01-14",
        "period": "First cycle",
        "creditsDecimal": 10,
        "creditsECTSDecimal": 100,
        "prerequisites": "30 credits in environmental science, biology, earth science, geography, social geography, national economics, sustainable energy transition or business.",
        "description": "The course covers multi-disciplinary approaches to the ecological, economic and social dimensions of sustainable development. Natural resources, ecosystem services and planetary boundaries in relation to economic growth and sustainable development. Sustainability indicators. Eco-labelling. Economic explanations to and solutions for environmental problems. Environmental economic valuation methods."
    },
    {
        "name": "Planning for Wind Energy",
        "campus": "Visby",
        "internationInstitution": "Department of Earth Sciences",
        "academicPeriodName": "Autumn 2023",
        "code": "1GV149",
        "occurenceName": "2023-10-31 to 2024-01-14",
        "period": "Second cycle",
        "creditsDecimal": 5,
        "creditsECTSDecimal": 33,
        "prerequisites": "A Bachelor's degree in engineering, science or social sciences. Also required is participation in Wind Power Development and Management, 15 credits. Proficiency in English equivalent to the Swedish upper secondary course English 6.",
        "description": "The course covers the theory and application of spatial planning for wind energy development and wind power projects. Local, regional and national regulations and permits are studied. The importance of good communication and acceptance among all stakeholders is practised in role play. Financial incentives and environmental considerations are evaluated for their potential effects on planning and on-schedule project execution. A role-play of a consultation meeting for a proposed wind farm will be enacted as well as an evaluation of social relevance and ethical considerations for wind power development."
    },
    {
        "name": "Specialisation in Multi-Criteria Decision Analysis for Wind Power Development",
        "campus": "Visby",
        "internationInstitution": "Department of Earth Sciences",
        "academicPeriodName": "Autumn 2023",
        "code": "1GV183",
        "occurenceName": "2023-10-31 to 2024-01-14",
        "period": "Second cycle",
        "creditsDecimal": 15,
        "creditsECTSDecimal": 100,
        "prerequisites": "A Bachelor's degree, equivalent to a Swedish Kandidatexamen, from an internationally recognised university. The main field of study must be within engineering, science or social science. 60 credits of Master's level courses in wind power project management. Proficiency in English equivalent to the Swedish upper secondary course English 6.",
        "description": "The optimisation of wind farms based on technical, economic, environmental and social aspects will be studied. These aspects of a wind farm project will also include consideration of infrastructures such as the grid and roads. Multi-criteria decision analysis (MCDA) methods will be introduced as an appropriate operational tool in the decision-aiding process for wind power development and will be applied to relevant portions. A proposal for the best solution regarding the optimum level of exploitation of wind power in a given area will be formulated."
    },
    {
        "name": "Specialisation in Planning for Wind Energy",
        "campus": "Visby",
        "internationInstitution": "Department of Earth Sciences",
        "academicPeriodName": "Autumn 2023",
        "code": "1GV159",
        "occurenceName": "2023-10-31 to 2024-01-14",
        "period": "Second cycle",
        "creditsDecimal": 15,
        "creditsECTSDecimal": 100,
        "prerequisites": "A Bachelor's degree in engineering, science or social science. Also required is 60 credits at Master's level in wind power project management including Planning for Wind Energy, 5 credits. Proficiency in English equivalent to the Swedish upper secondary course English 6.",
        "description": "The course addresses the planning conditions for wind power development. It provides a deeper theoretical understanding of planning and social acceptance issues as well as practical skills in how to work with local consultation processes, communication and conflict management. Topics covered include, for example, legislation, policy, and sound and visual impacts. Methodologically, the course gives an introduction to geographical information systems (ArcGIS) and observation methods.The course's different topics are also practised through exercises. You will also independently plan and execute practical assignments within a scientific study on an advanced level; either in relation to an ongoing research project at the department or by designing a research study on an advanced level."
    },
    {
        "name": "Specialisation in Wind Power Project Management",
        "campus": "Visby",
        "internationInstitution": "Department of Earth Sciences",
        "academicPeriodName": "Autumn 2023",
        "code": "1GV158",
        "occurenceName": "2023-10-31 to 2024-01-14",
        "period": "Second cycle",
        "creditsDecimal": 15,
        "creditsECTSDecimal": 100,
        "prerequisites": "A Bachelor's degree in engineering, science or social science. Also required is 60 credits at Master's level in wind power project management including Project Course: Feasibility Study of a Wind Power Project, 10 credits. Proficiency in English equivalent to the Swedish upper secondary course English 6.",
        "description": "The course will allow you to apply knowledge in wind power project management in all stages of a wind power project. This includes activities from the initial steps in site prospecting all the way to decommissioning and repowering. You will be given the opportunity to apply your understanding of each stage's risks and possibilities as well as to develop plans to capitalise on or avoid them."
    },
    {
        "name": "Specialisation in Wind Resource Assessment",
        "campus": "Visby",
        "internationInstitution": "Department of Earth Sciences",
        "academicPeriodName": "Autumn 2023",
        "code": "1GV160",
        "occurenceName": "2023-10-31 to 2024-01-14",
        "period": "Second cycle",
        "creditsDecimal": 15,
        "creditsECTSDecimal": 100,
        "prerequisites": "A Bachelor's degree in engineering, science or social science. Also required is 60 credits at Master's level in wind power project management including Project Course: Feasibility Study of a Wind Power Project, 10 credits, and Wind Resource Assessment, 5 credits, as well as 30 credits in mathematics, and 15 credits in Physics and/or Mechanics. Proficiency in English equivalent to the Swedish upper secondary course English 6.",
        "description": "The course focuses on wind resources and combines theory with practice. The theory is studied in terms of meteorology and fluid mechanics. In the portion concerning fluid mechanics, the essential theoretical background for numerical methods is covered. The applied portion contains a measurement campaign, which gives knowledge about equipment and data storage, analysis and filtration, and a simulation task which is solved using computational fluid dynamics (CFD)."
    },
    {
        "name": "Wind Power Development and Management",
        "campus": "Visby",
        "internationInstitution": "Department of Earth Sciences",
        "academicPeriodName": "Autumn 2023",
        "code": "1GV147",
        "occurenceName": "2023-08-28 to 2023-10-30",
        "period": "Second cycle",
        "creditsDecimal": 15,
        "creditsECTSDecimal": 100,
        "prerequisites": "A Bachelor's degree, equivalent to a Swedish Kandidatexamen, from an internationally recognised university. The main field of study must be within engineering, science or social science. Proficiency in English equivalent to the Swedish upper secondary course English 6.",
        "description": "The course includes studies of sustainable development and energy sources. Basic mathematical and physical concepts will be covered. An introduction to prerequisites for wind power development including how a wind turbine works, planning for wind energy, environmental impact, location and economic aspects will be given. The phases of wind power projects are studied. Oral and written presentations in a scientific context will be discussed and practised in the course.The course focuses on project management methodology and processes specific to the development of wind power projects. Project planning, project team organisation, negotiations and conflict resolutions are important parts of the course. A site study visit to an operating wind farm is included."
    },
    {
        "name": "Wind Project Management and Finance",
        "campus": "Visby",
        "internationInstitution": "Department of Earth Sciences",
        "academicPeriodName": "Autumn 2023",
        "code": "1GV157",
        "occurenceName": "2023-08-28 to 2023-10-30",
        "period": "Second cycle",
        "creditsDecimal": 5,
        "creditsECTSDecimal": 33,
        "prerequisites": "A Bachelor's degree in engineering, science or social science.  Also required is 45 credits at Master's level in wind power project management. Proficiency in English equivalent to the Swedish upper secondary course English 6.",
        "description": "The course includes work with scheduling and planning wind power projects. How to account for potential issues and provide solutions for both common and unexpected events within this scheduling will be introduced. The course will also describe how to develop a cost and a financing framework for a wind project's different phases, from concept to decommissioning. Included in this framework the key financial documents as well as contracts required at the different phases will be identified and evaluated. Additionally, the overall role of wind power in the energy system will be evaluated."
    },
    {
        "name": "Wind Resource Assessment",
        "campus": "Visby",
        "internationInstitution": "Department of Earth Sciences",
        "academicPeriodName": "Autumn 2023",
        "code": "1GV186",
        "occurenceName": "2023-10-31 to 2024-01-14",
        "period": "Second cycle",
        "creditsDecimal": 5,
        "creditsECTSDecimal": 33,
        "prerequisites": "A Bachelor's degree in engineering, science or social science. Also required is participation in Wind Power Development and Management, 15 credits. Proficiency in English equivalent to the Swedish upper secondary course English 6.",
        "description": "The course gives an overview of wind resource estimation. Meteorological and aerodynamic theories are essential parts of the course content. Different calculation and measurement methods will be addressed and critically evaluated to give you the knowledge and the tools to choose methods according to the requirements of a specific situation. A part of the course is training in wind energy calculation software like WindPRO, where theoretical knowledge is put to practical use."
    },
    {
        "name": "API Design and Best Practices",
        "campus": "Visby",
        "internationInstitution": "Department of Game Design",
        "academicPeriodName": "Autumn 2023",
        "code": "5SD815",
        "occurenceName": "2023-11-06 to 2024-01-14",
        "period": "First cycle",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 50,
        "prerequisites": "22.5 credits in computer science including Programming with C/C++ 1: Introduction, 5 credits and Programming with C/C++ 2: Algorithms, Data Structures and Design Patterns, 5 credits or 10 credits from courses with corresponding content.",
        "description": "The course teaches you to produce high-quality, highly usable and efficient-by-default code for others to use. The course is taught in C++ and focuses on interface design, clean code and testing. Through lectures and practical applications, you will understand idiomatic modern C++, expressive code, automated testing and test-driven design."
    },
    {
        "name": "Advanced Interactive Storytelling",
        "campus": "Visby",
        "internationInstitution": "Department of Game Design",
        "academicPeriodName": "Autumn 2023",
        "code": "5SD072",
        "occurenceName": "2023-11-06 to 2024-01-14",
        "period": "Second cycle",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 50,
        "prerequisites": "120 credits. Proficiency in English equivalent to the general entry requirements for first-cycle (Bachelor's level) studies.",
        "description": "This course explores advanced techniques for automatically generating stories that meet human expectations for credibility, coherence, and engagement. We will consider character simulations, plot-generators, and drama managers. Emphasis will be placed on themes that address human psychological needs. You will build several prototype games that tell stories, and participate through playtesting, critique, reflection, and discussion."
    },
    {
        "name": "Character Design and Representation",
        "campus": "Visby",
        "internationInstitution": "Department of Game Design",
        "academicPeriodName": "Autumn 2023",
        "code": "5SD060",
        "occurenceName": "2023-08-28 to 2023-11-05",
        "period": "First cycle",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 50,
        "prerequisites": "30 credits in game design",
        "description": "The course has an interdisciplinary basis and is based on the interaction between ethnology, gender studies and game design. The course looks at different perspectives of cultural representations and other dimensions of power impact such as gender and ethnicity. Special attention is paid to different ways of portraying these aspects in games and in relation to game functions (game mechanics). The course includes both theoretical and practical elements. You will then transfer your theoretical knowledge into practical formative assignments both in groups and individually, and analyse your work processes and results."
    },
    {
        "name": "Concept Art for Games",
        "campus": "Visby",
        "internationInstitution": "Department of Game Design",
        "academicPeriodName": "Autumn 2023",
        "code": "5SD529",
        "occurenceName": "2023-11-06 to 2024-01-14",
        "period": "First cycle",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 50,
        "prerequisites": "7.5 credits in the areas of expression in convergent media/graphic design, interactive media or culture and media",
        "description": "Learn idea development and digital sketching techniques for computer games! In this course, you will get to develop your digital painting skills, and your knowledge of the character and set design, visual representation and working from a prescribed brief."
    },
    {
        "name": "Deep Games",
        "campus": "Visby",
        "internationInstitution": "Department of Game Design",
        "academicPeriodName": "Autumn 2023",
        "code": "5SD308",
        "occurenceName": "2023-08-28 to 2023-11-05",
        "period": "Second cycle",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 50,
        "prerequisites": "120 credits. Proficiency in English equivalent to the general entry requirements for first-cycle (Bachelor's level) studies.",
        "description": "This course combines seminars with game design workshops in order to explore - theoretically and practically - how to design games that can illuminate the human condition and contribute to a meaningful life. We will look to your own personal experiences as inspiration sources for game ideas and use metaphor and analogy to create games on complex, abstract concepts, such as loyalty, dignity, courage or trust.Furthermore, we will draw on a range of theories and methods from relevant disciplines outside game design to expand our conception of what games can be and how they can impact players in a profound way. Theoretical frameworks are then tested through application to practical game design. This course provides you with opportunities to incubate a topic for a future degree project."
    },
    {
        "name": "Expression with 3D Environment Art for Games 2",
        "campus": "Visby",
        "internationInstitution": "Department of Game Design",
        "academicPeriodName": "Autumn 2023",
        "code": "5SD519",
        "occurenceName": "2023-08-28 to 2023-11-05",
        "period": "First cycle",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 50,
        "prerequisites": "Expression with 3D Environment Art for Games 1, 7.5 credits",
        "description": "This course focuses on 3D environment elements for digital games, with an in-depth focus on real-time 3D game graphics. During the course you will learn how to create dynamic objects such as rigid bodies, animated materials, particle effects and scripts. Upon successful completion of the course you will have a greater understanding of how to create dynamic game environments. The course is part of the Bachelor's Programme in Game Design and Graphics."
    },
    {
        "name": "Graphic Design for Games",
        "campus": "Visby",
        "internationInstitution": "Department of Game Design",
        "academicPeriodName": "Autumn 2023",
        "code": "5SD526",
        "occurenceName": "2023-08-28 to 2023-11-05",
        "period": "General entry requirements",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 50,
        "prerequisites": "",
        "description": "The course provides an introduction to graphic design for games. You will create a visual profile for a game that will include, for example, typography and GUI elements with rapid prototyping for an overall experience for the user."
    },
    {
        "name": "Introduction to Level Design",
        "campus": "Visby",
        "internationInstitution": "Department of Game Design",
        "academicPeriodName": "Autumn 2023",
        "code": "5SD550",
        "occurenceName": "2023-08-28 to 2023-11-05",
        "period": "General entry requirements",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 50,
        "prerequisites": "",
        "description": "The course will introduce level design as a practice and how it relates to and differs from game design. You will analyse existing game levels and use theory to design levels on paper. You will also use digital tools to create playable levels using prefabricated assets and your own scripts. This will culminate in a final project presentation."
    },
    {
        "name": "Life Design",
        "campus": "Visby",
        "internationInstitution": "Department of Game Design",
        "academicPeriodName": "Autumn 2023",
        "code": "5SD313",
        "occurenceName": "2023-11-06 to 2024-01-14",
        "period": "Second cycle",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 50,
        "prerequisites": "120 credits. Proficiency in English equivalent to the general entry requirements for first-cycle (Bachelor's level) studies.",
        "description": "By approaching life from a game design perspective, you can prepare for and implement concrete steps towards a soulful and sustainable life and become more \"future-proof\". Crafting one's way through life towards meaning and joy benefits from systems thinking, actionable idea generation, creative problem solving and the cycle of prototyping solutions, testing them and iterating on the result. That's what this course builds upon. Using game design strategies can help in creating prototypes that facilitate decision-making and navigating - one step and change at a time - towards one's own True North. The skill set learned in this course is invaluable across disciplines and jobs and will become ever more important as careers that last a lifetime have already become the exception, and the call for sustainability and acting and being in the world with personal integrity is key."
    },
    {
        "name": "Network Programming for Games 1",
        "campus": "Visby",
        "internationInstitution": "Department of Game Design",
        "academicPeriodName": "Autumn 2023",
        "code": "5SD808",
        "occurenceName": "2023-08-28 to 2023-11-05",
        "period": "First cycle",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 50,
        "prerequisites": "22.5 credits in computer science including Programming with C/C++ 1: Introduction, 5 credits and Programming with C/C++ 2: Algorithms, Data Structures and Design Patterns, 5 credits or 10 credits from courses with corresponding content.",
        "description": "The course is an introductory course to learn network programming with C/C++ with the help of low-level networks. The course also covers interprocess communication in distributed computing systems plus common network topologies."
    },
    {
        "name": "Test-Driven Level Design",
        "campus": "Visby",
        "internationInstitution": "Department of Game Design",
        "academicPeriodName": "Autumn 2023",
        "code": "5SD551",
        "occurenceName": "2023-11-06 to 2024-01-14",
        "period": "General entry requirements",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 50,
        "prerequisites": "",
        "description": "Throughout the course, you use analogue and digital level prototypes to perform tests with the purpose to gather data to help achieve the experience goals of a designed level. Using the data, you develop proposed changes to the level's design, with the aim to reach measurable design and experience goals. The course ends with a presentation where you describe your tests and discuss the data and the final result."
    },
    {
        "name": "Basic Swedish 1",
        "campus": "Visby",
        "internationInstitution": "Department of Scandinavian Languages",
        "academicPeriodName": "Autumn 2023",
        "code": "5PU028",
        "occurenceName": "2023-08-28 to 2024-01-14",
        "period": "General entry requirements",
        "creditsDecimal": 7.5,
        "creditsECTSDecimal": 25,
        "prerequisites": "General entry requirements (except the Swedish language requirement)",
        "description": "This is the course for you who want to learn the basics of the Swedish language. The course is aimed at international students without previous knowledge of the Swedish language. Basic Swedish 1 gives you an introduction to the Swedish language through teacher-led training and, to an extent, self-learning.The course gives you the basics of the Swedish language structure, vocabulary and writing skills. Listening comprehension and pronunciation are also included in the course. All these parts are taught parallelly during the course.The course focuses on themes from everyday life and the typical experience of being a student at Uppsala University. The course gives you the opportunity to practice the Swedish language in common everyday situations.Taking the course also gives you the opportunity to get to know and study with other international students. The course includes 48 lessons and you meet the teacher and your group twice a week. The passed course gives you 7.5 credits and you will be at the A1 level on the CEFR scale."
    }
]